Repository: OPUS4/application
Catalog: modules/admin/language/indexmaintenance.tmx
Source language: de
Languages: en

source: Verwaltung des Solr-Index
en: Solr Index Maintenance

source: Die Operation befindet sich momentan in der Ausführung. Die Ergebnisse werden angezeigt, sobald die Operation beendet wurde.
en: Operation is still in progress. Come back later to see results.

source: Die Operation ist zur Ausführung vermerkt. Die Ergebnisse werden angezeigt, sobald die Operation beendet wurde.
en: Operation is scheduled for execution. Come back later to see results.

source: Die Operation ist das erste Mal zur Ausführung vermerkt. Die Ergebnisse werden angezeigt, sobald die Operation beendet wurde.
en: Operation is scheduled for execution the first time. Come back later to see results.

source: Der Verarbeitungszustand der Operation konnte nicht ermittelt werden. Dies kann auf eine Fehlkonfiguration hindeuten.
en: Could not determine processing state. This might indicate a misconfiguration issue.

source: Überprüfung der Konsistenz
en: Perform Consistency Check

source: Prüft für jedes publizierte Dokument, ob es sich in der gleichen Version sowohl in der Datenbank als auch im Suchindex befindet. Gefundende Inkonsistenzen werden sofort aufgelöst.
en: Checks for each published document if it exists in database and search index. Furthermore, checks if both versions agree with each other. Any inconsistencies found will be resolved immediately.

source: Überprüfung der Volltextextraktion
en: Perform Fulltext Extraction Check

source: TODO kurze Beschreibung hinzufügen
en: TODO add a short description

source: TODO Durchführung einer Indexoptimierung
en: TODO Perform Index Optimization

source: kurze Beschreibung hinzufügen
en: add a short description

source: Starten
en: Run Job

source: Protokoll der letzen Ausführung
en: Log Output of Last Run

source: Verarbeitungszeit
en: Completion Time

source: Job %1s wurde erfolgreich in der Warteschlange abgelegt.
en: Job %1s was successfully submitted to queue.

source: Diese Funktion ist momentan deaktiviert. Sie kann nur verwendet werden, wenn die asynchrone Jobverarbeitung in der OPUS4-Konfiguration aktiviert wurde. Weitere Hinweise dazu finden Sie in der Dokumentation.
en: This feature is currently disabled. It is supported only if asynchronous job execution was enabled in OPUS4 configuration. Consult the documentation for more information.
